export const sampleTexts = {
  education: [
    { id: 1, text: "این یک متن نمونه برای جستجو است." },
    { id: 2, text: "کلمات کلیدی را به راحتی جستجو کنید." },
    { id: 3, text: "مطالعه منظم، کلید موفقیت است." },
    { id: 4, text: "روش‌های نوین آموزش زبان انگلیسی." },
    { id: 5, text: "تکنیک‌های یادگیری بهتر برای دانش‌آموزان." },
  ],
  technology: [
    { id: 6, text: "React و TypeScript برای ساخت اپلیکیشن عالی هستند." },
    { id: 7, text: "پیشرفت‌های اخیر در هوش مصنوعی." },
    { id: 8, text: "معماری نرم‌افزار و الگوهای طراحی." },
    { id: 9, text: "ابزارهای توسعه وب مدرن." },
    { id: 10, text: "برنامه‌نویسی واکنش‌گرا با React." },
    { id: 21, text: "برنامه‌نویسی واکنش‌گرا با React.js" },
  ],
  pwa: [
    { id: 11, text: "این پروژه یک PWA با قابلیت آفلاین است." },
    { id: 12, text: "نصب اپلیکیشن روی موبایل با PWA." },
    { id: 13, text: "کارکرد service worker در PWA." },
    { id: 14, text: "مزایای استفاده از Progressive Web Apps." },
    { id: 15, text: "چگونگی افزودن manifest به پروژه." },
  ],
  animation: [
    { id: 16, text: "انیمیشن های smooth و هایلایت کلمات." },
    { id: 17, text: "تکنیک‌های CSS برای انیمیشن‌های جذاب." },
    { id: 18, text: "کتابخانه‌های جاوااسکریپتی برای انیمیشن." },
    { id: 19, text: "هماهنگی انیمیشن با موقعیت اسکرول." },
    { id: 20, text: "ایجاد تجربه کاربری روان با انیمیشن‌ها." },
  ],
};
